
## Plan Result (aat)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.LAU-SYSTEM-PASSWORD
  * azurerm_key_vault_secret.LAU-SYSTEM-USER


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.LAU-SYSTEM-PASSWORD will be created
  + resource "azurerm_key_vault_secret" "LAU-SYSTEM-PASSWORD" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "lau-system-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.LAU-SYSTEM-USER will be created
  + resource "azurerm_key_vault_secret" "LAU-SYSTEM-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "lau-system-user-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":57,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->